app/Models/AuthModel.php

    public function updateLastSeen()
    {
        if (authCheck()) {
            $this->builder->where('id', user()->id)->update(['last_seen' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_seen` = '2025-02-04 08:35:15'
WHERE `id` = '5'