app/Models/CommonModel.php

SELECT *
FROM `slider`
WHERE `lang_id` = 1
ORDER BY `item_order`
---
    public function getSliderItemsByLang($langId)
    {
        $key = 'slider_' . $langId;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = $this->builderSlider->where('lang_id', clrNum($langId))->orderBy('item_order')->get()->getResult();

SELECT *
FROM `brands`
WHERE `show_on_slider` = 1
ORDER BY `name`
---
    public function getBrandsSlider()
    {
        $key = 'brands_slider';
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $rows = $this->builderBrands->where('show_on_slider', 1)->orderBy('name')->get()->getResult();

SELECT *
FROM `brands`
WHERE FIND_IN_SET(1432, category_data)
OR FIND_IN_SET(1380, category_data)
OR FIND_IN_SET(1385, category_data)
ORDER BY `name`
---
    public function getBrandsByCategory($category)
    {
        $key = !empty($category) ? 'brands_cat_' . $category->id : 'brands';
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        if (!empty($category)) {
            $categoryModel = new CategoryModel();
            $idsArray = $categoryModel->getCategoryParentTreeIdArray($category);
            if (!empty($idsArray) && countItems($idsArray) > 0) {
                foreach ($idsArray as $id) {
                    $this->builderBrands->orWhere("FIND_IN_SET(" . clrNum($id) . ", category_data)");
                }
            }
        }
        $rows = $this->builderBrands->orderBy('name')->get()->getResult();