app/Models/FieldModel.php

    public function getCustomFilters($categoryId, $categories = null)
    {
        $key = 'custom_filters_by_cat_' . $categoryId;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        $categoryIds = array();
        if (!empty($categories)) {
            $categoryIds = getIdsFromArray($categories);
        }
        if (!empty($categoryIds)) {
            $this->builder->join('custom_fields_category', 'custom_fields_category.field_id = custom_fields.id')->whereIn('custom_fields_category.category_id', $categoryIds, false);
        }
        $rows = $this->builder->select('custom_fields.*')->where('custom_fields.status', 1)->where('custom_fields.is_product_filter', 1)
            ->groupStart()->where('custom_fields.field_type', 'checkbox')->orWhere('custom_fields.field_type', 'radio_button')->orWhere('custom_fields.field_type', 'dropdown')->groupEnd()
            ->orderBy('custom_fields.field_order')->get()->getResult();
---
SELECT `custom_fields`.*
FROM `custom_fields`
JOIN `custom_fields_category` ON `custom_fields_category`.`field_id` = `custom_fields`.`id`
WHERE custom_fields_category.category_id IN (1380,1385,1432)
AND `custom_fields`.`status` = 1
AND `custom_fields`.`is_product_filter` = 1
AND   (
`custom_fields`.`field_type` = 'checkbox'
OR `custom_fields`.`field_type` = 'radio_button'
OR `custom_fields`.`field_type` = 'dropdown'
 )
ORDER BY `custom_fields`.`field_order`

    public function getProductFiltersOptions($customField, $langId, $customFilters, $queryStringArray = null)
    {
        $key = 'custom_filters_options_' . $customField->id;
        $rows = getCacheStatic($key);
        if (!empty($rows)) {
            return $rows;
        }
        if (!empty($customField)) {
            $this->builderFieldsOptions->where('custom_fields_options.field_id', clrNum($customField->id));
            if ($customField->sort_options == 'date') {
                $this->builderFieldsOptions->orderBy('custom_fields_options.id');
            }
            if ($customField->sort_options == 'date_desc') {
                $this->builderFieldsOptions->orderBy('custom_fields_options.id DESC');
            }
            if ($customField->sort_options == 'alphabetically') {
                $this->builderFieldsOptions->orderBy('option_key');
            }
            $rows = $this->builderFieldsOptions->get()->getResult();
---
SELECT *
FROM `custom_fields_options`
WHERE `custom_fields_options`.`field_id` = 12
ORDER BY `custom_fields_options`.`id` DESC