app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `is_promoted` = 1
---
    public function checkPromotedProducts()
    {
        $products = $this->builder->where('is_promoted', 1)->get()->getResult();